<h1>операции</h1>
<h2>Арифметические операции</h2>
<p>  + - * / ** %</p>
<p>Инкремент и декремент</p>
<?php
$i = 5;
echo --$i;
?>
<h2>Операция co строками - конкатенация</h2>
<?php
$str1 = 'Hello, ';
$str2 = 'word!';
echo $str1 . true;
?>
<h2>Операция сравнения</h2>
<p> < > == != <= >= </p>
<?php
$a = 5 == 5;
echo $a;
?>
<h2>операции строго сравнения</h2>
<p> === !==</p>
<?php
$b = (5 == '5');
$c = (5 === '5');
echo "b = $b, c = $c";
?>
<h2>Логические операции</h2>
<p>И(&& или and)ИЛИ(| или or)HE (!)</p>
<?php
$x = (true && false);
$y = (true || false);
echo "x = $x, y = $y";
?>
<h2>Операция присваивания</h2>
<p> = </p>
<?php
$e = $d = 'Hello';
$e = 5;
$e += 7;
$f = 3;
$f *= $e;?>
<p> = += -= *= /= **= .= %= </p>
<h2>Приоритет операция</h2>
<p>** (++ --) ! (* / %) (+ - .) (< > <=  >=) (== != === !==) && || (=  += ...) </p>

