<h1>Задача 1</h1>
<?php 
$a = 5;
$b = 10;
if($a < $b){
    echo  $a + $b;
} else {
    echo $a * $b;
}
?>
<h2>Задача 2</h2>
<?php
$a = 30;
$b = 60;
if($a > 0 && $b > 0 && $a + $b < 180){
} if ($a + $b ==90){
    echo  'Треугольник существует и является прямоугольным';
} else{
    echo 'Треугольник существует но не является прямоугольным';
} 
    echo 'Такого треугольника не существует';
?>
<h3>Задача 3</h3>
<?php
$age = 5;
if ($age <= 1){
    $ageGrop = "Котята";
} elseif ($age<=3){
    $ageGrop = "Молодые коты";
} elseif ($age<=7){
    $ageGrop = "Коты средних лет";
} else {
    $ageGrop = "Почтенные коты";
}  echo $ageGrop;
?>
<h4>Задача 4</h4> 
<?php
$a = 5;
$b = 6;
$c = 7;
if ($a +  $b > $a + $c > $b && $b + $c > $a){
    echo "такой треугольник существует";
} else {
    echo "Такого треугольника не существует";
}
?>
<h5>Задача 5</h5>
<?php
$N = 2024;
if ($N % 400 == 0 || ( $N % 4 == 0 && $N % 100 != 0)) {
    echo  'Год высокосный';
} else  {
    echo "Год не высокосный";
} 
?>
<h6>Задача 6</h6>
<?php
$a = 20000;
$b = 15000;
if (( $a + $b) > 32767){
    echo "Ошибка: Суммирование приводит к переполнению";
} else  {
    $sum = $a + $b;
} echo "Сумма чисел равна:" 
?>
<h7>Задача 7</h7>
<?php
$a = 10;
$b = 15;
$c = 8; 
$y = 12;
$z = 20;
$sho